**Задание1**

In [1]:
import pandas as pd

In [2]:
rating = pd.read_csv('ratings.csv')
rating.head()

   userId  movieId  rating   timestamp
0       1      307     3.5  1256677221
1       1      481     3.5  1256677456
2       1     1091     1.5  1256677471
3       1     1257     4.5  1256677460
4       1     1449     4.5  1256677264

In [3]:
rating.shape

(27753444, 4)

In [4]:
rating.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 27753444 entries, 0 to 27753443
Data columns (total 4 columns):
 #   Column     Dtype
---  ------     -----
 0   userId     int64
 1   movieId    int64
 2   rating     float64
 3   timestamp  int64
dtypes: float64(1), int64(3)
memory usage: 847.0 MB

In [5]:
fating_filter = rating.query('rating == {}'.format(5))

In [6]:
len(fating_filter)

4071135

In [7]:
fating_filter ['movieId'].value_counts().head(1)

318    48762
Name: movieId, dtype: int64

**Задание2**
По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [8]:
data = pd.read_csv('power.csv')
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [12]:
data[ data['country'].str.contains('lith', case=False) ]['country'].unique()

array(['Lithuania'], dtype=object)

In [19]:
filtered_countries = data[ ((data['country']=='Latvia') | (data['country']=='Estonia') | (data['country']=='Lithuania')) & ((data['category'] == 4) | (data['category'] == 12) | (data['category'] == 21)) & ((data['year'] >= 2005) & (data['year'] <= 2010))]

In [22]:
print('Суммарное потребление электроэнергии стран Прибалтики ',filtered_countries['quantity'].sum())

Суммарное потребление электроэнергии стран Прибалтики  240481.0

**Задание3**

In [25]:
page_url = 'http://www.pk.rusoil.net/page/minimalnoe-kolichestvo-ballov'

In [34]:
df = pd.read_html(page_url, encoding='utf-8', header=0)

In [35]:
df[1]

             Предметы  Минимальное количество баллов
0          Математика                             39
1        Русский язык                             40
2              Физика                             40
3               Химия                             40
4   Информатика и ИКТ                             42
5      Обществознание                             44
6             История                             40
7          Литература                             40
8            Биология                             40
9        ИТН-1, ИТН-2                             30
10       ИТН-3, ИТН-4                             26
11                ПИТ                             26